xiao6hu/test01/USB_MIDI_UC_OS2_20191123/Src/MCO/user_STM32.c
	/*
	//RPDO2
	OD_init(102 + i,0x6001,0x00,ODVAR,ODUS16,ODRW,ODNMP,0x00,0x00);//position demand value
	OD_init(103 + i,0x6001,0x01,ODVAR,ODUS16,ODRW,ODNMP,0x00,0x00);//position demand value
	OD_init(104 + i,0x6001,0x02,ODVAR,ODUS16,ODRW,ODNMP,0x00,0x00);//position demand value
	OD_init(105 + i,0x6001,0x03,ODVAR,ODUS16,ODRW,ODNMP,0x00,0x00);//position demand value
	
	//RPDO3
	OD_init(106 + i,0x6002,0x00,ODVAR,ODUS16,ODRW,ODNMP,0x00,0x00);//position demand value
	OD_init(107 + i,0x6002,0x01,ODVAR,ODUS16,ODRW,ODNMP,0x00,0x00);//position demand value
	OD_init(108 + i,0x6002,0x02,ODVAR,ODUS16,ODRW,ODNMP,0x00,0x00);//position demand value
	OD_init(109 + i,0x6002,0x03,ODVAR,ODUS16,ODRW,ODNMP,0x00,0x00);//position demand value
	
	//RPDO4
	OD_init(110 + i,0x6003,0x00,ODVAR,ODUS16,ODRW,ODNMP,0x00,0x00);//position demand value
	OD_init(112 + i,0x6003,0x01,ODVAR,ODUS16,ODRW,ODNMP,0x00,0x00);//position demand value
	OD_init(113 + i,0x6003,0x02,ODVAR,ODUS16,ODRW,ODNMP,0x00,0x00);//position demand value
	OD_init(114 + i,0x6003,0x03,ODVAR,ODUS16,ODRW,ODNMP,0x00,0x00);//position demand value
	*/
	//自定义参数
	OD_init(28 + i,0x6004,0x00,ODVAR,ODUS8,ODRW,ODNMP,0x00,0x00);//DeviceAddress
	OD_init(29 + i,0x6005,0x00,ODVAR,ODUS8,ODRW,ODNMP,0x00,0x00);//LightsMode
	OD_init(30 + i,0x6006,0x00,ODVAR,ODUS16,ODRW,ODNMP,0x0000,0x0000);//LedNumber
	OD_init(31 + i,0x6006,0x01,ODVAR,ODUS8,ODRW,ODNMP,0x00,0x00);//ColorOrder
	OD_init(32 + i,0x6006,0x02,ODVAR,ODUS8,ODRW,ODNMP,0x00,0x00);//ChipType
	OD_init(33 + i,0x6006,0x03,ODVAR,ODUS32,ODRW,ODNMP,0x00,0x00);//PlayFps+StopFps+CycleFps
	OD_init(34 + i,0x6006,0x04,ODVAR,ODUS8,ODRW,ODNMP,0x00,0x00);//PatternNumber
	OD_init(35 + i,0x6006,0x05,ODVAR,ODUS8,ODRW,ODNMP,0x00,0x00);//LedColorCycleMode
	
	//结束标志
	OD_init(36 + i,0xffff,0xff,0xff,0xffff,0xff,0xff,0xffffffff,0xffffffff);
	#endif
}
#endif


/**************************************************************************
GLOBAL FUNCTIONS
***************************************************************************/

/**************************************************************************
DOES:    Call-back function for get data from ProcImg.
**************************************************************************/

/**************************************************************************
DOES:    Call-back function for occurance of node off line event.
**************************************************************************/
void Node_OffLineHandle(BYTE Node_ID)
{
}
/**************************************************************************
DOES:    Call-back function for occurance of SDO abort.
**************************************************************************/
void SDO_AbortHandle(BYTE Node_ID)
{
}
/**************************************************************************
DOES:    Call-back function for occurance of a fatal error.
Stops operation and displays blnking error pattern on LED
**************************************************************************/
void MCOUSER_FatalError (WORD ErrCode)
{
	// To Do: DEBUG, report Error Code
}
/**************************************************************************
DOES:    Call-back function for occurance of a emergency.
Do anything you need when slave node emergency msg received
**************************************************************************/

void MCO_Handle_Emergency(BYTE Node_ID)
{
}
/**************************************************************************
DOES:    Call-back function for reset application.
Starts the watchdog and waits until watchdog causes a reset.
**************************************************************************/
void MCOUSER_ResetApplication (void)
{
	while (1) // No wait until Watchdog hits
	{
	}
}


/**************************************************************************
DOES:    Call-back function for reset communication.
Re-initializes the process image and the entire MicroCANopen
communication.
**************************************************************************/
void MCOUSER_ResetCommunication (void)
{
	WORD delay;
	ODTALE_init();
	// 125kbit, Node 6, 2s heartbeat
  	MCO_Init(125,ODNodeID,0);
#if NR_OF_SLAVES > 0
	//Number 0 slave, node_id 0x06,0ms heartbeat time,10ms sdo timeout, 3times to retry
	MCO_SLV_Init(0,ODNodeID,0,0,0);
#endif	
  	// DEBUG: Delay 10ms for all external HW to catch up
  	delay = gTimCnt + 10;
  	while (!MCOHW_IsTimeExpired(delay))
  	{
  	}
	// RPDO1, default ID(0x200+nodeID), 1 bytes
	MCO_InitRPDO(1);
  	// RPDO2, default ID(0x300+nodeID), 2 bytes
	//MCO_InitRPDO(2);
	// RPDO3, TPDO1 OF NODE 0X07, 2 bytes
  	//MCO_InitRPDO(3);
	MCO_InitTPDO(1);
  	// TPDO1, default ID (0x180+nodeID), 0ms event, 0ms inhibit, 2 bytes
}

/**************************************************************************
END-OF-FILE
***************************************************************************/
